var NumberX = 1;
NumberX = - NumberX;
alert (NumberX);  // -1, застосували унарний мінус

var x = 10, y = 11;
alert ( y - x);  // 1, тепер мінус бінарний

var str = "В'ячеслав" + "- це ім'я";
alert (str); // В'ячеслав - це ім'я. Ця операція називається КОНКАТЕНАЦІЯ (додавання рядків)
alert ( '2' + 2); // "22"
alert ( 3 + '3'); // "33"

alert ( 4 - '2'); // 2
alert ( 8 / '2'); // 4

var a,b,c;
a = b = c = 8 + 2;
alert (a); // 10
alert(b); // 10
alert(c); // 10

alert( 6 % 2); // 0, залишок від ділення 6 на 2
alert( 11 % 3); //2, залишок від ділення 11 на 3
alert(9 % 4); // 1, залишок від ділення 9 на 4

var i = 0;
i++; // більш короткий запис для i = i + 1. ІНКРЕМЕНТ
i--; // більш короткий запис для i = i - 1. ДЕКРЕМЕНТ
alert(i); // 0
5++ ;// Такий код дасть помилку, бо ці оператори застосовуються тільки до змінних.

// Префіксна форма
var i = 0;
var a = ++i; // змінна а буде збільшена на 1
alert (a); // 1
// Постфіксна форма
var i = 0;
var a =i++;
alert (a); // 0

// Суміщены оператори
var n = 2;
n += 5; // тепер n=7 (працює як n= n + 5)
n *= 2; //тепер n=14 (працює як n= n * 2)
alert(n); // 14
// Практика скороченої форми
var n = 2;
n *= 3 + 5;
alert(n); // 16 ( n 2 * 8)


// Задача. Інкремент, порядок спрацьовування
var a = 1, b = 1, c,d;
c = ++a; alert (c); // 2, бо префіксна форма спочатку збільшує а на 1 до 2, а потім повертає с
d = b++; alert (d); // 1, бо постфіксна форма збільшує, але повертає старе значення
c = (2+ ++a); alert (c); // 5, бо спочатку збільшує а до 3, потім використовується в арифмтиці
d = (2 + b++); alert(d); // 4, бо спочатку збільшує b до 3, але у цьому вираженны залишили старе значення
alert(a); // 3, бо кожну змынну було збільшено по 2 рази
alert(b); // 3, бо кожну змынну було збільшено по 2 рази


// Задача. Результат присвоювання
var a = 2;
var n = 1 + (a *= 2);
alert(n); // 5


// Задача. Проста арифметика з рядками
var a="Мама ", b="ми", c="ла", d=" ра"; e ="му";
alert(a+b+c+d+e);


